[
  {
    "name": null,
    "country": null,
    "review_date": "30 August 2022",
    "score": "10",
    "title": "Only there for a short time but would love to go back!",
    "positive": "The rooms are clean and smells good and the hosts were very accommodating and helpful showing places around.",
    "negative": "There was a noise (sounded like a humming generator going on and off) at night, but it wasn’t loud enough to keep you from sleeping.",
    "scraped_at": "2025-04-04T17:45:02.459731"
  },
  {
    "name": null,
    "country": null,
    "review_date": "23 October 2024",
    "score": "9.0",
    "title": "Superb",
    "positive": "The suites could not be in a better location. We arrived on a late night ferry and the suites were easy to find close to the harbour. The staff were very friendly and helpful! The beds are so comfortable and we had a very peaceful stay!",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:02.463733"
  },
  {
    "name": null,
    "country": null,
    "review_date": "21 October 2024",
    "score": "9.0",
    "title": "Beautiful location, views from our balcony and amazing staff",
    "positive": "Ina and Daniel were very helpful and accommodating during our stay. The location was excellent, very close to everything! The view from our balcony was beautiful!",
    "negative": "Lots of stairs getting to hotel was a little tricky getting the suitcases there. Other than that amazing :)",
    "scraped_at": "2025-04-04T17:45:02.466731"
  },
  {
    "name": null,
    "country": null,
    "review_date": "16 October 2024",
    "score": "10",
    "title": "comfortable, cozy, tasteful",
    "positive": "Beautiful Milos was one of our favourite islands. And the White Suites, set near the top of the hill was a gorgeous spot. A great patio for hanging out, morning, noon and night.\nThe breakfast offered (for extra price) was worth it: very hearty and good coffee.\nThe staff were exceptionally helpful.",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:02.469731"
  },
  {
    "name": null,
    "country": null,
    "review_date": "14 October 2024",
    "score": "10",
    "title": "Loved it here...Sooo peaceful and the most gorgeous staff",
    "positive": "The BEST BREAKFASTS!!",
    "negative": "Liked all",
    "scraped_at": "2025-04-04T17:45:02.473703"
  },
  {
    "name": null,
    "country": null,
    "review_date": "13 October 2024",
    "score": "10",
    "title": "An amazing stay in Milos!",
    "positive": "Great location, nice hot tub, helpful staff",
    "negative": "Only con was no breakfast was available- but this totally makes sense because we were there at the end of the season!",
    "scraped_at": "2025-04-04T17:45:02.476702"
  },
  {
    "name": null,
    "country": null,
    "review_date": "11 October 2024",
    "score": "9.0",
    "title": "Our stay was wonderful - We felt at home and like family staying at the White Suites.",
    "positive": "A lovely boutique vibe.",
    "negative": "Located very close to the port, shops and lots of restaurant options.",
    "scraped_at": "2025-04-04T17:45:02.479730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "10 October 2024",
    "score": "9.0",
    "title": "Superb",
    "positive": "Cleanliness of bedroom wow",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:02.482731"
  },
  {
    "name": null,
    "country": null,
    "review_date": "8 October 2024",
    "score": "10",
    "title": "Stay here in Milos, my third time on the island and this is by far the best accommodation",
    "positive": "Very clean, central location MASSIVE room, great facilities staff are exceptional, shout out to the manager Dimitri, very welcoming and accommodating",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:02.486730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "5 October 2024",
    "score": "9.0",
    "title": "Lovely owner and lovely room",
    "positive": "Lovely place short walk to shops and restaurant.",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:02.489730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "28 September 2024",
    "score": "10",
    "title": "Exceptional",
    "positive": "This place is so close to the port and easy to access. I loved the rooms, it had everything needed. Breakfast was wonderful as well.",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:05.981549"
  },
  {
    "name": null,
    "country": null,
    "review_date": "26 September 2024",
    "score": "9.0",
    "title": "Fantasctic, great location",
    "positive": "We only spent a couple of days in Milos, the most beautiful of the islands we visited. The White Suites is a nice place to stay, Dimitris was very friendly and we followed all his tips for our activities and places to eat, it was the best decision!",
    "negative": "The bathroom in our room was a bit small.",
    "scraped_at": "2025-04-04T17:45:05.984550"
  },
  {
    "name": null,
    "country": null,
    "review_date": "25 September 2024",
    "score": "10",
    "title": "Charming boutique hotel right next to the port",
    "positive": "This is the most wonderful hotel in the most wonderful island that we visited. Neema is just wonderful and was very helpful with EVERYTHING.  The room was large and new and the bed and shower were sumptuous. The outdoor terrace is a plus for breaks during the hot days or after dinner. Bartholomew the cat was adorable (and I’m not a cat person).  Don’t bother with car rentals elsewhere. Neema can arrange one for you at better price points. If you are looking to support a wonderful local business, look no further. I would come back here in a heartbeat.",
    "negative": "Nothing",
    "scraped_at": "2025-04-04T17:45:05.988522"
  },
  {
    "name": null,
    "country": null,
    "review_date": "24 September 2024",
    "score": "10",
    "title": "Amazing Comfortable Stay",
    "positive": "We loved our stay at the White Suites. Everything was perfect. Our ferry was changed and arrived many hours earlier than the original time, but they accommodated us and allowed us to do early check in. We loved how the place is very nicely designed and decorated with every detail taken into account. The room was very comfortable and sparkling clean. Also loved the racks for drying clothes and outdoor beds and tables, very thoughtful. The breakfast is also amazing and everyone is super friendly. We highly recommend!",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:05.991550"
  },
  {
    "name": null,
    "country": null,
    "review_date": "23 September 2024",
    "score": "10",
    "title": "Stay here for good people, location, and breakfast!",
    "positive": "Perfect location with many nice walking paths down to town, port, or beach. Daniel was super lovely, knowledgeable, and helpful! Stay here for good people and breakfast!",
    "negative": "None",
    "scraped_at": "2025-04-04T17:45:05.994521"
  },
  {
    "name": null,
    "country": null,
    "review_date": "23 September 2024",
    "score": "10",
    "title": "Had a lovely 5 nights stay and will definitely look forward to coming back",
    "positive": "Nice location, up high, good views\nLia was amazing so helpful and always happy and smiling. Daniel was also great with check in. Staff always there to help you. Owner always in contact also to make sure everything was good",
    "negative": "A bit of a steep climb from port and a lots of stairs but not that bad.",
    "scraped_at": "2025-04-04T17:45:05.997549"
  },
  {
    "name": null,
    "country": null,
    "review_date": "20 September 2024",
    "score": "8.0",
    "title": "lovely stay, had everything we needed and the owners were really personable.",
    "positive": "the owners were really friendly, really close to the port and nice and clean.",
    "negative": "nothing, all really nice however it is quite uphill",
    "scraped_at": "2025-04-04T17:45:06.001550"
  },
  {
    "name": null,
    "country": null,
    "review_date": "19 September 2024",
    "score": "10",
    "title": "Perfection in every way - White Suites, the island, the food and Greek hospitality.",
    "positive": "A perfect stay in a clean, open, airy room with great amenities.  Our host Inna and her son Sam totally made us feel like we were family visiting them in their lovely home.  When trying to decide where to stay, you always check out pictures and try to imagine the property.  The White Suites are totally amazing.  Not only was the room just gorgeous and clean, but the terrace overlooking the city is just the best spot in Milos!  The pictures do not do it justice.  We loved eating our delicious breakfast there and coming back in the evening after a long Beach day or exploring and sitting up there with a beautiful breeze and comfy furniture with a great glass of wine.  And, the company/conversation with Inna and Sam.  When we arrived kind of late, we had the opportunity to meet with Sam, a map and the best of recommendations.  I would recommend using the taxi they work with as it helped us very much as the walk up from the ferry terminal is too much with suitcases.  We walked back down to the ferry terminal without issues.  Our beach trip to Fyriplaka beach was unforgettable - arriving around 9am and hardly anyone there with crystal clear waters.  We left around 2 and it was getting quite busy.  SO glad to have Inna help with taxi as trying to park your own vehicle would be a challenge.  Thankful we went to Sarakiniko Beach- we enjoyed watching the young people jumping from the cliffs and the incredible moonscape landscape.  Glad we went early as it got crowded and hot later on. Visit to Plaka is a must.",
    "negative": "Leaving",
    "scraped_at": "2025-04-04T17:45:06.005549"
  },
  {
    "name": null,
    "country": null,
    "review_date": "19 September 2024",
    "score": "10",
    "title": "Charming suite and great location",
    "positive": "Elegant design.  Staff snd location was perfect",
    "negative": "That you needed to pay for your breakfast",
    "scraped_at": "2025-04-04T17:45:06.008550"
  },
  {
    "name": null,
    "country": null,
    "review_date": "18 September 2024",
    "score": "8.0",
    "title": "Lovely place to stay, great location.",
    "positive": "Great location with a lovely terrace sitting area overlooking the sea. Comfy, clean, cosy room well equipped. Delicious breakfast on the terrace.",
    "negative": "There was a coffee machine but I Would have liked a kettle.",
    "scraped_at": "2025-04-04T17:45:06.012550"
  },
  {
    "name": null,
    "country": null,
    "review_date": "18 September 2024",
    "score": "10",
    "title": "Would stay here again in a heartbeat.",
    "positive": "Amazing property , amazing location couldn’t recommend highly enough. Staff are exceptionally helpful !",
    "negative": "Nothing",
    "scraped_at": "2025-04-04T17:45:09.496730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "12 September 2024",
    "score": "10",
    "title": "Perfect",
    "positive": "The property was as pictured, lovely and comfortable.  The staff were what made the property a stand out.",
    "negative": "The wasn’t anything at all",
    "scraped_at": "2025-04-04T17:45:09.499729"
  },
  {
    "name": null,
    "country": null,
    "review_date": "11 September 2024",
    "score": "9.0",
    "title": "Superb",
    "positive": null,
    "negative": "Not super acc",
    "scraped_at": "2025-04-04T17:45:09.503730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "11 September 2024",
    "score": "10",
    "title": "I like my staying here. I’m very recommended",
    "positive": "I like everything, room  was very cozy, comfortable bed, bathroom is clean and big enough, balcony and you can dry your clothes outside. 5 minutes to walk from port . We stayed there only 2 days, and I’m miss already . Inna and Sam was very friendly and was my pleasure to meet them. Guys you are the best!!!",
    "negative": "-",
    "scraped_at": "2025-04-04T17:45:09.506734"
  },
  {
    "name": null,
    "country": null,
    "review_date": "6 September 2024",
    "score": "9.0",
    "title": "Good Location",
    "positive": "Good location. Clean. Serviced each day. Very comfortable bed.",
    "negative": "Walk up the hill from main town.",
    "scraped_at": "2025-04-04T17:45:09.509730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "6 September 2024",
    "score": "10",
    "title": "Beautiful hotel",
    "positive": "Perfect hotel in the centre of the city, located 5min from the port and all shops and restaurants.Clean and comfortable rooms. Very nice and friendly stuff, always positive and ready to help.",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:09.512730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "6 September 2024",
    "score": "10",
    "title": "Fabulous place would highly recommend",
    "positive": "From the initial welcome with Inna who provided us with wonderful information about Milos to the great breakfast served with the wonderful and friendly Lia who guided us with great tips to the great breakfast prepared by Lydia.",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:09.516730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "2 September 2024",
    "score": "10",
    "title": "Exceptional",
    "positive": "Great place in an awesome location. Host was super welcoming and informative about the island and restaurants. Bed was very comfortable!! Rooms were clean and had everything we needed.",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:09.519730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "29 August 2024",
    "score": "10",
    "title": "Great host and great location, definitely recommend",
    "positive": "We loved the staff at the White Suites! Our room was beautiful, we loved our private hot tub, and so close to the port",
    "negative": "No changes!",
    "scraped_at": "2025-04-04T17:45:09.522730"
  },
  {
    "name": null,
    "country": null,
    "review_date": "29 August 2024",
    "score": "9.0",
    "title": "Fabulous",
    "positive": "Beautiful presented room clean with great balcony and views. Sun rise 10/10. Owner went out of his way to help us arrange hire vehicle and recommended places for dinner",
    "negative": null,
    "scraped_at": "2025-04-04T17:45:09.526730"
  }
]